{
    "@context": {
      "schema": "https://schema.org",
      "cmp": "https://schema.commercemesh.ai/ns#"
    },
    "@type": "Organization",
    "name": "Insight Editions",
    "description": "Celebrated for its deep dedication to quality, Insight Editions is a bestselling publisher of books and collectibles that push the boundaries of creativity, design, and production. Through its licensed publishing program, Insight Editions produces unique books and products that provide meaningful ways to engage with characters and stories. Insight Editions' award-winning art and photography titles celebrate the artistry and history of a wide range of subjects, from rock to film to nature conservation. Insight Editions' New York Times bestsellers include Bowie: Stardust, Rayguns & Moonage Daydreams, Henry Winkler's I've Never Met an Idiot on the River, and Radhanath Swami's The Journey Within. Recent national bestsellers include Friends: The Official Cookbook, Harry Potter: Knitting Magic, and The Elder Scrolls: The Official Cookbook. Insight Editions manifests its dedication to sustainability and conservation through publishing partnerships with organizations such as Jane Goodall Institute, The National Parks Association, Mission Blue, and Roots of Peace.",
    "url": "https://insighteditions.com",
    "logo": "https://cdn.shopify.com/s/files/1/0057/3728/3618/files/logo.png",
    "brand": {
        "@type": "Brand",
        "name": "Insight Editions",
        "logo": "https://cdn.shopify.com/s/files/1/0057/3728/3618/files/logo.png",
        "identifier": {
            "@type": "PropertyValue",
            "propertyID": "cmp:brandId  ",
            "value": "urn:cmp:brand:11cdde9b-6a0c-5c18-8d01-11f701089cc2"
        }
    },
    "sameAs": [
      "https://www.instagram.com/insighteditions",
      "https://www.facebook.com/InsightEditions"
    ],
    "cmp:category": [
      "books",
      "gifts",
      "licensed-merchandise"
    ],
    "cmp:productFeed": {
      "@type": "DataFeed",
      "url": "https://cmp.overway.ai/feed/4fc180ab-8d07-4623-be6a-fbe134d252c2/feed.json"
    },
    "identifier": {
        "@type": "PropertyValue",
        "propertyID": "cmp:orgId",
        "value": "urn:cmp:org:11cdde9b-6a0c-5c18-8d01-11f701089cc2"
    }
  }
